# Jitter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplaySketchyLines..::..Jitter Property
ViewDisplaySketchyLines Class See Also
---
The jitter defines jitteriness of the line. Values between 0 and 10.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public int Jitter { get; set; }
```

Visual Basic
---
```text
Public Property Jitter As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Jitter {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The jitter value is not valid. The valid range is 0 to 10. |

# See Also
ViewDisplaySketchyLines Class
Autodesk.Revit.DB Namespace